from Interface import Interface

# TODO: Придумать задачу
# TODO: Сделать обратное преобразование
# TODO: Сделать вывод решения на экран
# TODO: Сделать логирование итераций
# TODO: Написать отчет
# TODO: Переход в двойственную задачу
# TODO: Решение двойственной задачи

"""
Задача
    Количество переменных:    6
    Положительные переменные: [0, 1, 2]
    Целевая функция:          [3, -4, 2, 1, 4, 3]
    0 ограничений >=:         [[2, 9, 1, 0, 3, 0],
                                   [4, -1, -2, -3, 10, 1]]
    
    3 ограничения <=:         [[-3, -1, -4, -2, -10, 3]
                                  ]
                              
    3 ограничения =:          [[3, 2, 0, 8, 6, 0],
                                  [9, 3, 0, 8, 2, 2],
                                  [8, 1, 1, 0, 8, 0]]
    
    Вектор правой части:      [1, -9, 2, 6, 7, 6]
"""

"""
Стандартная форма:
A = [[2, 9, 1, 0, 3, 1, 0, -3, -1],
    [-3, -1, 5, 2, -7, 2, -2, 7, -2],
    [4, 7, 3, 1, -2, 5, -1, 2, -5],
    [4, 5, 10, 4, -3, 1, -4, 3, -1],
    [-4, -5, -10, -4, 3, -1, 4, -3, 1],
    [0, 4, 2, 5, 2, -1, -5, -2, 1],
    [0, -4, -2, -5, -2, 1, 5, 2, -1],
    [2, 3, 1, 7, 2, -1, -7, -2, 1],
    [-2, -3, -1, -7, -2, 1, 7, 2, -1]]
        
b = [1, -9, 5, 7, -7, 3, -3, 2, -2]
c = [3, -4, 2, 1, 4, 7, -1, -4, -7]

"""

if __name__ == "__main__":
    interface = Interface()
    interface.main_loop()
